import { BASE_URL } from "@/constans";

  
export const campusComputerMetadata = {
    metadataBase: new URL(BASE_URL),
    title: {
        default: 'ক্যাম্পাস কম্পিউটার: কলেজ বাজার লালমনিরহাটের অনলাইন সেবা কেন্দ্র',
        template: '%s -- ক্যাম্পাস কম্পিউটার',
    },
    description: `ক্যাম্পাস কম্পিউটার (কলেজ বাজার, লালমনিরহাট): ঘরে বসে কলেজ ও বিশ্ববিদ্যালয়ের সকল সেবা — ভর্তি, ফর্ম পূরণ, পরীক্ষা ফি ও অন্যান্য পেমেন্ট — সহ কম্পিউটার ও ইন্টারনেট সম্পর্কিত সকল অনলাইন সার্ভিসের নির্ভরযোগ্য কেন্দ্র। লালমনিরহাট সরকারি কলেজের নিকটে অবস্থিত, এখানে পাবেন প্রিন্টিং, স্ক্যানিং, অনলাইন আবেদন, ফটো এডিট, এবং আরও অনেক প্রযুক্তিগত সহায়তা।`,
    alternates: {
        canonical: BASE_URL,
    },
    icons: {
        icon: '/favicon.ico',
    },
    openGraph: {
        title: 'ক্যাম্পাস কম্পিউটার: কলেজ বাজার লালমনিরহাটের অনলাইন সেবা কেন্দ্র',
        description: `ক্যাম্পাস কম্পিউটার: কলেজ ও বিশ্ববিদ্যালয়ের ভর্তি, ফর্ম পূরণ, পরীক্ষা ফি ও পেমেন্টসহ কম্পিউটার ও ইন্টারনেট সম্পর্কিত সব ধরনের অনলাইন সেবা। কলেজ বাজার, লালমনিরহাট সরকারি কলেজের পাশে অবস্থিত আপনার বিশ্বস্ত প্রযুক্তি সহযোগী।`,
        url: BASE_URL,
        images: [
            {
                url: '/og-image.png',
                width: 1200,
                height: 630,
                alt: 'Campus Computer OG Image',
            },
        ],
        siteName: 'Campus Computer',
        type: 'website',
        locale: 'bn_BD',
    },
    twitter: {
        card: 'summary_large_image',
        title: 'ক্যাম্পাস কম্পিউটার: কলেজ বাজার লালমনিরহাটের অনলাইন সেবা কেন্দ্র',
        description: `ভর্তি, ফর্ম পূরণ, পেমেন্ট, প্রিন্টিং, স্ক্যানিং, ফটো এডিট, এবং আরও অনেক অনলাইন সেবা এখন ক্যাম্পাস কম্পিউটার থেকে — কলেজ বাজার, লালমনিরহাট।`,
        images: ['/og-image.png'],
    },
};
