import { BASE_URL } from "@/constans";


export const campusComputerMetadata = {
    metadataBase: new URL(BASE_URL),
    title: {
        default: 'ক্যাম্পাস কম্পিউটার: লালমনিরহাট সরকারি কলেজের শিক্ষার্থীদের জন্য সকল কার্যক্রম ব্যবস্থাপনার সফটওয়্যার সলিউশন',
        template: '%s -- ক্যাম্পাস কম্পিউটার',
    },
    description: `ক্যাম্পাস কম্পিউটার (কলেজ বাজার, লালমনিরহাট): এর জন্য আধুনিক অনলাইন প্ল্যাটফর্ম, যেখানে তুমি সরাসরি কলেজে না গিয়েই যেকোনো কলেজের ভর্তি ফরম পুরোপুরি অনলাইনে আবেদন করতে পারবে! ভর্তি ফরম পূরণ থেকে শুরু করে পেমেন্ট, তথ্য যাচাই — সবই হবে ঘরে বসে। Campus Computer টিম তোমার জন্য করবে সব ব্যুরোক্র্যাটিক কাজ, তাই সময় ও ঝামেলা নেই একদম! দ্রুত, সহজ এবং নিরাপদ ভর্তি প্রক্রিয়া এখন তোমার আঙ্গিনায়। Lalmonirhat-এর শিক্ষার্থীদের জন্য আদর্শ ডিজিটাল সেবা!`,
    alternates: {
        canonical: BASE_URL,
    },
    icons: {
        icon: '/favicon.ico',
    },
    openGraph: {
        title: 'ক্যাম্পাস কম্পিউটার: কলেজ বাজার লালমনিরহাটের অনলাইন সেবা কেন্দ্র',
        description: `ক্যাম্পাস কম্পিউটার: কলেজ ও বিশ্ববিদ্যালয়ের ভর্তি, ফর্ম পূরণ, পরীক্ষা ফি ও পেমেন্টসহ কম্পিউটার ও ইন্টারনেট সম্পর্কিত সব ধরনের অনলাইন সেবা। কলেজ বাজার, লালমনিরহাট সরকারি কলেজের পাশে অবস্থিত আপনার বিশ্বস্ত প্রযুক্তি সহযোগী।`,
        url: BASE_URL,
        images: [
            {
                url: '/og-image.png',
                width: 1200,
                height: 630,
                alt: 'Campus Computer OG Image',
            },
        ],
        siteName: 'Campus Computer',
        type: 'website',
        locale: 'bn_BD',
    },
    twitter: {
        card: 'summary_large_image',
        title: 'ক্যাম্পাস কম্পিউটার: কলেজ বাজার লালমনিরহাটের অনলাইন সেবা কেন্দ্র',
        description: `ভর্তি, ফর্ম পূরণ, পেমেন্ট, প্রিন্টিং, স্ক্যানিং, ফটো এডিট, এবং আরও অনেক অনলাইন সেবা এখন ক্যাম্পাস কম্পিউটার থেকে — কলেজ বাজার, লালমনিরহাট।`,
        images: ['/og-image.png'],
    },
};
